{   
    "historyTitle" : "Mi Historia",
    "historyText" : "Dejemos a un lado la programación. Te invito a conocerme fuera de la programación, a conocer mi historia y a compartir parte de mis viajes y aventuras.",
    "challenge" : "Desafio JS",
    "challengeText" : "Sigue paso a paso la evolución del reto 50 proyectos Javascript.",
    "contactTitle" : "Contactame",
    "contactText" : "¿Te parece interesante mi perfil? No dudes en ponerte en contacto conmigo.",
    "title1" : "Acerca de mi",
    "presentation" : "Hola soy Joaco, Full Stack Developer. Tengo una mentalidad creativa, buenas habilidades y experiencia en tecnologías como HTML5, CSS, React, React Native, MongoDB, Express y Node.js. Tengo habilidades para trabajar en equipo utilizando la metodología AGILE y de forma colaborativa en Github, construyendo proyectos desde cero, demostrando iniciativa y capacidad para adquirir conocimientos de forma autodidacta. El uso de librerías Javascript, me permiten diseñar y desarrollar interfaces atractivas y funcionales que deleitan a los usuarios. Busco el crecimiento profesional continuo, estoy orientado a objetivos y acostumbrado a trabajar con plazos ajustados. Me gustan los cambios, los retos intelectuales y aprender nuevas tecnologías, también puedo establecer buenas relaciones interpersonales y tengo la capacidad de trabajar en equipos de alto rendimiento de forma colaborativa. Si quiere saber más sobre mí, no dude en ponerse en contacto conmigo.",
    "html" : "HTML5 es el lenguaje de marcado utilizado para estructurar y presentar contenidos en la web, CSS es el lenguaje de estilo que define el aspecto de una página web. HTML5 se encarga de organizar y etiquetar elementos como texto, imágenes y formularios, mientras que CSS se utiliza para controlar el diseño, los colores, las fuentes y otros aspectos visuales. Ambos trabajan juntos para crear páginas web atractivas y funcionales.",
    "js": "Incorporar JavaScript a una aplicación web proporciona interactividad, manipulación en tiempo real, validación de formularios y comunicación eficaz con el servidor. Estas ventajas combinadas mejoran la experiencia del usuario y la eficacia general de la aplicación.",
    "react": "React y React Native son tecnologías que permiten desarrollar interfaces de usuario interactivas y eficientes para aplicaciones web y móviles, respectivamente. Con React se pueden crear interfaces escalables y reutilizables en aplicaciones web, mientras que React Native permite desarrollar apps móviles nativas para iOS y Android con una única base de código. Ambas tecnologías ofrecen una experiencia de usuario de alta calidad y reducen el tiempo y los costes de desarrollo.",
    "back": "Al incorporar Node.js, MongoDB y Express en el backend de tu aplicación, obtienes una potente combinación. Node.js permite crear aplicaciones web rápidas y escalables, MongoDB ofrece una base de datos flexible y fácil de usar, y Express simplifica el desarrollo de API y aplicaciones web. Juntos, aportan eficiencia, escalabilidad y productividad al desarrollo del backend.",
    "others" : "Las bibliotecas JavaScript proporcionan funcionalidades predefinidas que ahorran tiempo y ofrecen características avanzadas para mejorar el desarrollo de un proyecto. Figma me permite diseñar interfaces de usuario de forma eficiente y colaborativa, agilizando el proceso de diseño. Y eso no es todo, sigo estudiando y aprendiendo nuevos lenguajes y tecnologías para ampliar mis habilidades.",
    "title2" : "Mis proyectos" 
}